# ConstrainedToWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..ConstrainedToWall Property
BuiltInFailures..::..WallFailures Class See Also
---
Sketch Lines created with Pick Wall must remain parallel to the Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConstrainedToWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConstrainedToWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConstrainedToWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace